<template>
  <div class="Page">
    <h1>这是一个基于富文本编辑器实现的电子病历</h1>
    <p>ps:电子病历 技术栈 typescript vue3</p>
    <p>* 基础脚手架封装(已完成)</p>
    <p>* 病历样式类似world(已完成)</p>
    <p>* 页眉页脚(已完成)</p>
    <p>* 编辑器分页(已完成)</p>
    <p>* 自定义光标样式(已完成)</p>
    <p>* 自定义块状组件(已完成)</p>
    <p>* 气泡菜单(已完成)</p>
    <p>* 鼠标右键菜单(已完成)</p>
    <p>* 修改痕迹（已完成）</p>
    <p>* 批注（已完成）</p>
    <p>* 在线协同编辑(已完成)</p>
    <p>* 质控功能(已完成)</p>
    <p>* 自定义控件（下拉 单选 多选 svg交互）(已完成)</p>
    <p>* 历史记录快（捷键回退）（已完成）</p>
    <p>* 快照版本回退(已完成)</p>
    <p>* 电子签名(已完成)</p>
  </div>
</template>
